# Download with resuming and segmented downloading
brew "aria2"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Arbitrary-precision unit-aware calculator
brew "fend"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Double-Array Trie Library
brew "libdatrie"
# Thai language support library
brew "libthai"
# Distributed revision control system
brew "git"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Digital clock in ncurses
brew "tty-clock"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AI Coding Agent IDE
cask "antigravity"
# Audio utility
cask "background-music"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Display management tool
cask "betterdisplay"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-symbols-only-nerd-font"
# Download accelerator and organiser
cask "free-download-manager"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Free and open-source media player
cask "iina"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Multiplayer online battle arena game
cask "league-of-legends"
# Software for Logitech devices
cask "logi-options+"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Full TeX Live distribution with GUI applications
cask "mactex"
# UI replacement for volume, brightness and now playing controls
cask "mediamate"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Discord music status that works with any media player
cask "music-presence"
# Htop on steroids
cask "neohtop"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 361285480
mas "Microsoft Outlook", id: 985367838
mas "Noir", id: 1592917505
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "WattsConnected", id: 1639692859
mas "WhatsApp", id: 310633997
mas "WutheringWaves", id: 6475033368
vscode "anysphere.cursorpyright"
vscode "davidanson.vscode-markdownlint"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "pkief.material-icon-theme"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"
